Revit 2027 API
FamilyInstanceCreationData(XYZ, FamilySymbol, StructuralType) Constructor
Initializes a new instance of the FamilyInstanceCreationData class
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstanceCreationData(
	XYZ location,
	FamilySymbol symbol,
	StructuralType structuralType
)
Public Sub New (
	location As XYZ,
	symbol As FamilySymbol,
	structuralType As StructuralType
)
public:
FamilyInstanceCreationData(
	XYZ^ location,
	FamilySymbol^ symbol,
	StructuralType structuralType
)
new :
        location : XYZ *
        symbol : FamilySymbol *
        structuralType : StructuralType -> FamilyInstanceCreationData
Parameters
location XYZ
 The physical location where the instance is to be placed.
symbol FamilySymbol
 A FamilySymbol object that represents the type of the instance that is to be inserted.
structuralType StructuralType
 Specify if the family instance is structural.
See Also
Reference
FamilyInstanceCreationData Class
FamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace